In [15]:
import pandas as pd

# Przykład:
df1 = pd.DataFrame({
    'name': ['Ala', 'Bartek', 'Celina'],
    'age': [25, 30, 35]
}, index=[1, 2, 3])

df2 = pd.DataFrame({
    'city': ['Kraków', 'Warszawa', 'Gdańsk']
}, index=[2, 3, 4])

pd.concat([df1.reset_index(), df2.reset_index()], axis=1)

   index    name  age  index      city
0      1     Ala   25      2    Kraków
1      2  Bartek   30      3  Warszawa
2      3  Celina   35      4    Gdańsk

In [19]:
df3 = pd.DataFrame({
    'name': ['Ala', 'Celina', 'Daniel'],
    'city': ['Lublin', 'Łódź', 'Poznań']
})

pd.concat([df1.reset_index(), df3.reset_index()], axis=1)

# df1.join(df3.set_index('name'), on='name')
print(f'df3')
df3

df3

     name    city
0     Ala  Lublin
1  Celina    Łódź
2  Daniel  Poznań

In [20]:
df1.join(df3.set_index('name'), on='name')

     name  age    city
1     Ala   25  Lublin
2  Bartek   30     NaN
3  Celina   35    Łódź